Repository: xstatic/jaxfoodie
Catalog: sites/all/translations/commerce_coupon-7.x-1.0-beta5.*.po
Languages: fr

source: Home
fr: Accueil

source: Delete
fr: Supprimer

source: Operations
fr: Actions

source: Cancel
fr: Annuler

source: Edit
fr: Modifier

source: This action cannot be undone.
fr: Cette action est irréversible.

source: Settings
fr: Paramètres

source: Name
fr: Nom

source: Label
fr: Étiquette

source: Active
fr: Actif

source: Store
fr: Boutique

source: Override
fr: Supplanter

source: Order
fr: Ordre

source: Coupon
fr: Bon de réduction

source: Coupons
fr: Bons de réduction

source: Date created
fr: Date de création

source: Machine name
fr: Nom système

source: Is active
fr: Est actif

source: Date updated
fr: Date mise à jour

source: Save and add fields
fr: Enregistrer et ajouter les champs

source: Commerce Order
fr: Commande Drupal Commerce

source: Deleted product type %name.
fr: Type de produit %name supprimé.

source: Save coupon
fr: Enregistrer le coupon

source: The date the coupon was created.
fr: La date à laquelle le coupon a été créé.

source: The machine name specified is already in use.
fr: Le nom système spécifié est déjà utilisé.

source: Create !name
fr: Créer !name

source: Validate a coupon
fr: Valider un coupon

source: commerce coupon to validate
fr: bon de réduction Commerce à valider

source: Redeem a coupon
fr: Rembourser un coupon

source: commerce coupon to redeem
fr: Coupon Commerce à rembourser

source: Set coupon as valid
fr: Définir le coupon comme valide

source: Normaly the validation result is concatenated by an AND operator. Here you can bypass this and set the value to true.
fr: Normalement, le résultat de la validation est concaténé par un opérateur AND. Vous pouvez contourner ceci et mettre la valeur sur TRUE, (vrai).

source: Set coupon as invalid
fr: Rendre le bon de réduction invalide

source: Create coupon line item
fr: Créer un élément de commande de type réduction

source: commerce order
fr: commande Commerce

source: coupon amount
fr: montant du bon de réduction

source: coupon amount currency code
fr: code de devise du montant du bon de réduction

source: commerce coupon line item
fr: Ligne article Coupon

source: Get the redemption number of a coupon
fr: Obtenir le numéro de rachat d'un coupon

source: number of uses
fr: nombre d'utilisations

source: Commerce Coupon Type
fr: Type de bon de réduction Commerce

source: Administer Coupon Settings
fr: Administrer les paramètres de Coupon

source: Allows users to manage coupon settings.
fr: Autoriser les utilisateurs à gérer les paramètres des coupons.

source: Administer Coupon Types
fr: Administrer les Types Coupons

source: Allows users to manage coupon types.
fr: Autoriser les utilisateurs à gérer les types de coupons.

source: Administer Coupons
fr: Administrer les coupons

source: Allows users to manage coupons.
fr: Autoriser les utilisateurs à gérer les coupons.

source: Your coupon code cannot be redeem.
fr: Votre code coupon ne peut être racheté

source: Coupon Code
fr: Code du coupon

source: Coupon line item for fixed coupon amounts.
fr: Ligne article pour les montants à taux fixe des coupons.

source: Add coupon
fr: Ajouter un coupon

source: Your coupon code is not valid.
fr: Votre code de coupon n'est pas valide.

source: Indicates if the coupon can be used or not.
fr: Indique si le coupon peut ou non être utilisé.

source: Global configuration for coupons.
fr: Configuration globale des coupons.

source: You have not created any coupon types yet. Go to the <a href="@create-coupon-type">coupon type creation page</a> to add a new coupon type.
fr: Vous n'avez pas encore créé de Types de coupon. Allez dans la <a href="@create-coupon-type">page de création de types de coupon</a> pour ajouter un nouveau type de coupon.

source: No coupon type have been created yet for you to use.
fr: Aucun type de coupon utilisable n'a encore été créé.

source: The human-readable name of this coupon type.
fr: Le nom affiché de ce type de coupon.

source: A unique machine-readable name for this coupon type. It must only contain lowercase letters, numbers, and underscores.
fr: Un nom système unique pour ce type de coupon. Il ne doit contenir que des lettres en minuscules, des nombres et des tirets bas.

source: If checked, the default fields for this coupon type will be reset.
fr: Si coché, les champs par défaut de ce type de coupon seront réinitialisés.

source: Save coupon type
fr: Enregistrer le type de coupon

source: Delete coupon type
fr: Supprimer le type de coupon

source: This coupon code is already in use.
fr: Ce code de coupon est déjà utilisé.

source: Coupon Code Length
fr: Longueur du code de coupon

source: Set the coupon code length for auto generated codes.
fr: Définir la longueur du code coupon pour l'auto-génération de codes.

source: Number Of Redemptions
fr: Nombre de rachats

source: Coupon Validation: Set the coupon as invalid if number of uses is reached
fr: Validation du coupon : définir le coupon comme invalide si le nombre d'utilisation est atteint.

source: Coupon Validation: Check the number of redemptions
fr: Validation du coupon : vérifier le nombre de rachats

source: Number of Uses
fr: Nombre d'utilisations

source: (Machine name: @type)
fr: (Nom système : @type)

source: Price component type
fr: Type du composant de prix

source: Price components track changes to prices made during the price calculation process, and they are carried over from the unit price to the total price of a line item. When an order total is calculated, it combines all the components of every line item on the order. When the unit price is altered by this action, the selected type of price component will be added to its data array and reflected in the order total display when it is formatted with components showing. Defaults to base price, which displays as the order Subtotal.
fr: Les composants de prix suivent les changements appliqués au prix durant le processus de calcul et sont reportés à partir du prix unitaire au prix total d'un élément de commande. Quand un total de commande est calculé, il combine tous les composants de chaque élément de la commande. Lorsque le prix unitaire est altéré par cette action, le type de composant de prix sélectionné sera ajouté à son tableau de données et se retrouvera dans l'affichage du total de la commande quand il est formaté avec des composants affichés. Par défaut le prix de base, qui s'affiche comme Sous-total de la commande.

# a drupal commerce coupon
source: Coupon ID
fr: ID du bon de réduction

source: The internal numeric ID of the coupon.
fr: L'identifiant (ID) numérique interne du bon de réduction.

source: The human readable name of the coupon type.
fr: Le nom affiché du type de bon de réduction.

source: Enter here your coupon code.
fr: Saisissez le code de votre bon de réduction ici.

source: Add a destination parameter to operations links so users return to this View on form submission.
fr: Ajoute un paramètre de destination aux liens d'actions de façon à ce que les utilisateurs retournent à cette vue après soumission du formulaire.

source: Coupon type
fr: Type de bon de réduction

source: The machine name of the coupon type.
fr: Le nom système du type de bon de réduction.

source: Remove a coupon from an order
fr: Retirer un bon de réduction d'une commande

source: Remove all coupons from an order
fr: Retirer tous bons de réduction d'une commande

source: Create Coupon
fr: Créer un bon de réduction

source: Create a new coupon
fr: Créer un nouveau bon de réduction

source: Add coupon type
fr: Ajouter un type de bon de réduction

source: Coupon saved.
fr: Bon de réduction enregistré.

source: Coupon type saved.
fr: Type de bon de réduction enregistré.

source: The coupon type %name has been deleted.
fr: Le type de bon de réduction %name a été supprimé.
